// 'use strict';
// ****************************
// the Task №1
// var x = prompt('Введите Х', '1'), // не было запятой
//     y = prompt('Введите Y', '1');

// alert( 'Сумма: ' + x + y );
// ****************************

// ****************************
// the Task №2
// var x = 3,
//     y = x * 3,
//     z = x + y;

//     alert(x);
//     alert(y);
//     alert(z);
// ****************************

// ****************************
// the Task №3
// var firstName = prompt('Введите Имя: ', ''),
//     lastName = prompt('Введите Фамилию: ', '');

//     firstName = firstName.charAt(0).toUpperCase() + firstName.slice(1);
//     lastName = lastName.charAt(0).toUpperCase() + lastName.slice(1);

// alert(`" What’s up ${``+ firstName} ${``+ lastName} "`);
// ****************************

// ****************************
// the Task №4
// var x = prompt('Input x: ', ''),
//     y = prompt('Input y: ', '');

// summ = parseInt(x) + parseInt(y);
// alert(`x * y =  ${x * y}`);
// alert(`x / y =  ${x / y}`);
// alert(`x - y =  ${x - y}`);
// alert(`x + y =  ${summ}`);
// ****************************

// ****************************
// the Task №5
// var x = prompt('Введите число: ', ''),
//     num = parseInt(x);

// if (num % 2 === 0) {
//     alert('Введённое число: <<чётное>>');
// } else {
//     alert('Введённое число: <<нечётное>>');
// }
// ****************************

// ****************************
// the Task №6
// ****************************

// ****************************
// the Task №7
// ****************************

// ****************************
// the Task №8
// ****************************

// ****************************
// the Task №9
// ****************************

// ****************************
// the Task №10
// ****************************