// **********************************************
// Task №1

// **********************************************

// **********************************************
// Task №2
// var x = +prompt('Введите скорость движения улитки(от -10 до 10)', '');

// if (x > 0) {
//     alert('улитка идёт вперёд!');
// } else if (x < 0) {
//     alert('улитка идёт назад!');
// } else if (x === 0) {
//     alert('улитка стоит на месте!');
// }
// **********************************************

// **********************************************
// Task №3
// var x = +prompt('У меня денег в гривне: ', ''),
//     y = +prompt('У друга денег в гривне: ', ''),
//     summ;

// summ = x + y;

// if (summ <= 1000) {
//     alert('Хрен слетаешь на Мальту, и не хватет выучить английский язык!!! ))) Остаётся только пиво!!!');
// } else if (summ >= 1000, summ < 5000) {
//     alert('Нечего пить пиво, денег хватает выучить английский!!!');
// } else if (summ >= 5000, summ < 30000S) {
//     alert('Пора собирать вещи и на Мальту');
// }
// **********************************************

// **********************************************
// Task №4
// var age = +prompt('Введите сколько вам лет: ', '');

// if (age >= 20, age < 30) {
//     alert('Вам выслана повестка!');
// } else {
//     alert('Вы не попадаете на призыв! Повесткиии неее будет!!!');
// }
// **********************************************

// **********************************************
// Task №5
// var busNumber1 = 7,
//     busNumber2 = 225,
//     busNumber3 = 255,
//     theBusArrived = +prompt('Прибыл автобус по маршруту №: ', '');

// if (theBusArrived === busNumber1) {
//     alert('Проходите на посадку!');
// } else if (theBusArrived === busNumber2) {
//     alert('Проходите на посадку!');
// } else if (theBusArrived === busNumber3) {
//     alert('Проходите на посадку!');
// }else {
//     alert('Ожидайте свой маршрут!');
// }
// **********************************************

// **********************************************
// Task №6
// var day = new Date();

// day.getUTCDay();
// console.log(day);

// if (day !== 5, day !== 6) {
//     alert('Вам пора на работу(');
// } else {
//     alert('Сегодня выходной!!!');
// }
// **********************************************

// **********************************************
// Task №7
// var userName = prompt('Введите имя: ', '');

// if ( userName == null) {
//     alert('К сожалению вы не ввели имя, досвидания!!!)))');
// } else {
//     alert('Привет, ' + userName);
// }
// **********************************************

// **********************************************
// Task №8
// var usd_uan = +prompt('Сколько вы хотите купить долларов?: ', ''),
//     cursUsd = 25.10,
//     calcUsd;

// switch (usd_uan) {
//     case usd_uan:
//         alert('С Вас: ' + (calcUsd = usd_uan * cursUsd) + ' гр ' + '  Продажа по курсу за 1$:  ' + cursUsd + ' гр');
//         break;
// }

// var uan_usd = +prompt('Сколько вы хотите сдать долларов?: ', ''),
//     cursUan = 24.50,
//     calcUan;

// switch (uan_usd) {
//     case uan_usd:
//         alert('Вам: ' + (calcUan = uan_usd * cursUan) + ' гр ' + '  Покупка по курсу за 1$:  ' + cursUan + ' гр');
//         break;
// }
// **********************************************

// **********************************************
// Task №9
var greeting = '',
    userName = prompt('Input name: ', ''),
    lang = prompt('Выберите язык "ru", "en", "de" ' + userName, ' ');

if (lang === 'ru') {
    greeting = alert('Добрый день ' + userName + ' !');
    console.log(greeting);
} else if (lang === 'en') {
    greeting = alert('Good day ' + userName + ' !');
    console.log(greeting);
} else if (lang === 'de') {
    greeting = alert('guten Tag ' + userName + ' !');
};
// **********************************************

// **********************************************
// Task №10
// **********************************************
// **********************************************
// Task №11
// **********************************************

// **********************************************
// Task №12
// **********************************************