// **********************************************
// Task №1

// **********************************************

// **********************************************
// Task №2
// var x = +prompt('Введите скорость движения улитки(от -10 до 10)', '');

// if (x > 0) {
//     alert('улитка идёт вперёд!');
// } else if (x < 0) {
//     alert('улитка идёт назад!');
// } else if (x === 0) {
//     alert('улитка стоит на месте!');
// }
// **********************************************

// **********************************************
// Task №3
// var x = +prompt('У меня денег в гривне: ', ''),
//     y = +prompt('У друга денег в гривне: ', ''),
//     summ;

// summ = x + y;

// if (summ <= 1000) {
//     alert('Хрен слетаешь на Мальту, и не хватет выучить английский язык!!! ))) Остаётся только пиво!!!');
// } else if (summ >= 1000, summ < 5000) {
//     alert('Нечего пить пиво, денег хватает выучить английский!!!');
// } else if (summ >= 5000, summ < 30000S) {
//     alert('Пора собирать вещи и на Мальту');
// }
// **********************************************

// **********************************************
// Task №4
// var age = +prompt('Введите сколько вам лет: ', '');

// if (age >= 20, age < 30) {
//     alert('Вам выслана повестка!');
// } else {
//     alert('Вы не попадаете на призыв! Повесткиии неее будет!!!');
// }
// **********************************************

// **********************************************
// Task №5
var busNumber1 = 7,
    busNumber2 = 225,
    busNumber3 = 255,
    theBusArrived = +prompt('Прибыл автобус по маршруту №: ', '');

if (theBusArrived === busNumber1) {
    alert('Проходите на посадку!');
} else if (theBusArrived === busNumber2) {
    alert('Проходите на посадку!');
} else if (theBusArrived === busNumber3) {
    alert('Проходите на посадку!');
}else {
    alert('Ожидайте свой маршрут!');
}
// **********************************************

// **********************************************
// Task №6
// **********************************************

// **********************************************
// Task №7
// **********************************************

// **********************************************
// Task №8
// **********************************************

// **********************************************
// Task №9
// **********************************************

// **********************************************
// Task №10
// **********************************************